tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "bash"
brew "coreutils"
brew "elixir"
brew "eza"
brew "fzf"
brew "gawk"
brew "gh"
brew "ghc"
brew "gnu-sed"
brew "grep"
brew "lua"
brew "neovim"
brew "node"
brew "pyenv"
brew "python@3.11"
brew "ripgrep"
brew "rustup-init"
brew "starship"
brew "telnet"
brew "tmux"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "alacritty"
cask "anki"
cask "discord"
cask "font-caskaydia-cove-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "karabiner-elements"
cask "linearmouse"
cask "maccy"
cask "numi"
cask "obs"
cask "obsidian"
cask "raycast"
cask "rectangle"
cask "steam"
cask "visual-studio-code"
cask "zed"
vscode "alefragnani.project-manager"
vscode "eamodio.gitlens"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-pull-request-github"
vscode "haskell.haskell"
vscode "jdinhlife.gruvbox"
vscode "justusadam.language-haskell"
vscode "letrieu.expand-region"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tobias-z.vscode-harpoon"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
vscode "xcad2k.vscode-thedigitallife"
